import { Poetry, PoetryType } from "./poetry-match.types";

const poetryList: Poetry[] = [
  {
    title: '静夜思',
    author: '唐·李白',
    paragraphs: [
      '床前明月光', '疑是地上霜',
      '举头望明月', '低头思故乡',
    ],
    desc: '《静夜思》是一首五言诗，此诗描写了旅居在外的诗人于秋日夜晚在屋内抬头望月而思念家乡的感受。前两句写诗人在作客他乡的特定环境中一刹那间所产生的错觉；后两句通过动作神态的刻画，深化主人公的思乡之情。全诗没有奇特新颖的想象，没有精工华美的辞藻，只是用叙述的语气，采取比喻、衬托等手法，表达客居思乡之情，语言清新朴素而韵味含蓄无穷，历来广为传诵。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '春晓',
    author: '唐·孟浩然',
    paragraphs: [
      '春眠不觉晓', '处处闻啼鸟',
      '夜来风雨声', '花落知多少',
    ],
    desc: '《春晓》是一首五言绝句。此诗抓住诗人早晨刚醒时的一瞬间展开联想，描绘了一幅春晨绚丽的图景，抒发了诗人热爱春天、珍惜春光的美好心情。首句破题，写春睡的香甜，也流露着对朝阳明媚的喜爱；次句即景，写悦耳的春声，也交代了醒来的原因；第三句转写回忆；末句又回到眼前，由喜春翻为惜春。全诗语言平易浅近，自然天成，言浅意浓，景真情真，深得自然意趣。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '相思',
    author: '唐·王维',
    paragraphs: [
      '红豆生南国', '春来发几枝',
      '愿君多采撷', '此物最相思',
    ],
    desc: '《相思》是一首五言绝句，此诗借咏物而寄相思，全篇不离红豆，用其相思子之名以关合相思之情。首句写红豆产地；次句以“发几枝”一问，此语极朴实，而又极富形象性，设问自然，暗寓情怀；第三句寄意友人“多采撷”，言在此而意在彼；末句点明其相思属性，用一“最”字将情感推达极致，使“多采撷”的理由自见，且自身所寄之意亦深含其中。全诗风格明快，却又委婉含蓄，语浅而情深，相传当时即为人谱曲传唱，流行江南。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '寻隐者不遇',
    author: '唐·贾岛',
    paragraphs: [
      '松下问童子', '言师采药去',
      '只在此山中', '云深不知处',
    ],
    desc: '《寻隐者不遇》是一首五言古诗。此诗首句写寻者问童子，后三句都是童子的答话，诗人采用寓问于答的手法，把寻访不遇的焦急心情描绘得淋漓尽致。诗中以白云比隐者的高洁，以苍松喻隐者的风骨，写寻访不遇，愈衬出寻者对隐者的钦慕高仰之情。全诗遣词通俗清丽，白描无华，情真意切，言简义丰。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '江雪',
    author: '唐·柳宗元',
    paragraphs: [
      '千山鸟飞绝', '万径人踪灭',
      '孤舟蓑笠翁', '独钓寒江雪',
    ],
    desc: '《江雪》是一首五言绝句。诗中运用典型概括的手法，选择千山万径，人鸟绝迹这种最能表现山野严寒的典型景物，描绘大雪纷飞，天寒地冻的图景；接着勾画独钓寒江的渔翁形象，借以表达诗人在遭受打击之后坚韧不屈、坚守信念却又深感孤寂的情绪。全诗构思独特，语言简洁凝练，意蕴丰富。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '登鹳雀楼',
    author: '唐·王之涣',
    paragraphs: [
      '白日依山尽', '黄河入海流',
      '欲穷千里目', '更上一层楼',
    ],
    desc: '《登鹳雀楼》是一首五言绝句。此诗前两句写的是自然景色，开笔就有缩万里于咫尺之势；后两句写意，把哲理与景物、情势融合得天衣无缝。诗人在受到大自然震撼之后，悟出的是朴素而深刻的哲理：登高放眼，能够催人抛弃固步自封的浅见陋识，不断拓出愈益美好的崭新境界。清代诗评家认为：“王诗短短二十字，前十字大意已尽，后十字有尺幅千里之势。”此诗篇幅虽短，却以千钧巨椽，绘下北国河山的磅礴气势和壮丽景象，气势磅礴、意境深远。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '宿建德江',
    author: '唐·孟浩然',
    paragraphs: [
      '移舟泊烟渚', '日暮客愁新',
      '野旷天低树', '江清月近人',
    ],
    desc: '《宿建德江》是一首山水诗，刻画了秋江暮色，是唐人五绝中的写景名篇。诗人把小船停靠在烟雾迷蒙的江边思忆往昔，以舟泊暮宿作为自己抒发感情的归宿，流露出羁旅之思。首联点题，为下文写景抒情作铺垫；颔联中“日暮”是“客愁新”的原因；颈、尾两联中，因为“野旷”所以天低于树，因为“江清”所以月能近人，将天和树、人和月的关系，写得恰切逼真。此诗前两句为触景生情，后两句为借景抒情，描写了清新的秋夜，细腻地表现了景物特点，其格调淡而有味、含而不露，自然流出、风韵天成，颇有特色。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '秋夜寄邱员外',
    author: '唐·韦应物',
    paragraphs: [
      '怀君属秋夜', '散步咏凉天',
      '空山松子落', '幽人应未眠',
    ],
    desc: '《秋夜寄丘二十二员外》是一首五言绝句，此诗表达诗人在秋夜对隐居朋友的思念之情。诗的前两句写诗人自己，即怀人之人；后两句写正在临平山学道的丘丹，即所怀之人。全诗语淡而情浓、言短而意深，诗人从容落笔，浅浅着墨，格调古朴雅致，安闲恬淡，具有悠永的韵味，玩绎不尽。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '登乐游原',
    author: '唐·李商隐',
    paragraphs: [
      '向晚意不适', '驱车登古原',
      '夕阳无限好', '只是近黄昏',
    ],
    desc: '这首诗赞美黄昏前的绮丽风光，抒发了诗人即景而生的感慨。前两句点出其登原游览的原因：由于黄昏日暮心情不适，便驱车登上古原；后两句极力赞叹晚景之美：在夕阳余晖照耀下，涂抹上一层金色的世界，此两句并非简单地盛赞无限美好的夕阳，其意蕴丰富，具有极高的美学价值和思想价值。全诗语言明白如话，毫无雕饰，节奏明快，感喟深沉，富于哲理。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '送别',
    author: '唐·王维',
    paragraphs: [
      '山中相送罢', '日暮掩柴扉',
      '春草明年绿', '王孙归不归',
    ],
    desc: '《送别》是一首五言绝句。此诗描写送别友人，表达了对友人的依依不舍之情，其题材普遍，构思却独具匠心，极有特色。它最显著的特点在于并非就“送别”二字做文章，而着墨于送别后的行动与思绪，并表达了诗人期盼来年春草再绿时能与友人团聚的情怀。全诗语言朴素自然，感情深厚真挚，意中有意，味外有味，匠心独运，耐人咀嚼。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '竹里馆',
    author: '唐·王维',
    paragraphs: [
      '独坐幽篁里', '弹琴复长啸',
      '深林人不知', '明月来相照',
    ],
    desc: '《竹里馆》是一首山水诗。此诗写隐者的闲适生活以及情趣，描绘了诗人月下独坐、弹琴长啸的悠闲生活，遣词造句简朴清丽，传达出诗人宁静、淡泊的心情，表现了清幽宁静、高雅绝俗的境界。全诗虽篇幅极短，但有景有情、有声有色、有静有动、有实有虚，对立统一，相映成趣，是诗人生活态度以及作品特点的绝佳体现。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '送方外上人',
    author: '唐·刘长卿',
    paragraphs: [
      '孤云将野鹤', '岂向人间住',
      '莫买沃洲山', '时人已知处',
    ],
    desc: '《送方外上人》是一首五言绝句。此诗前两句以凌云的野鹤形容僧人，贴切有味，理应不失孤云野鹤般脱俗的品性；后两句写诗人对方外上人的讽喻规劝，劝上人隐居冷寂的深山，不要到热闹的名胜去沽名钓誉。这首诗语言妙趣横生，闲散淡远，构思精巧。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '鹿柴',
    author: '唐·王维',
    paragraphs: [
      '空山不见人', '但闻人语响',
      '返景入深林', '复照青苔上',
    ],
    desc: '《鹿柴》是一首五言绝句。此诗描写了一座人迹罕至的空山、一片古木参天的树林。第一句先正面描写空山的杳无人迹，侧重于表现山的空寂清冷；紧接着第二句境界顿出，其中的响声短暂而局部地打破了山的寂静，但并未改变其整体的空旷与寂寥；第三、四句由上幅的描写空山传语转而描写深林返照，由声而至色。全诗语言清新自然，运用以动衬静、以局部衬全局的手法，把禅意渗透于自然景色的生动描绘之中，创造了一个清寂幽深的境界。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '杂诗三首·其二',
    author: '唐·王维',
    paragraphs: [
      '君自故乡来', '应知故乡事',
      '来日绮窗前', '寒梅著花未',
    ],
    desc: '这首诗是《杂诗三首》中第二首。此诗描写游子思念家人，向故乡来人询问家中情形的话。其对于家园的断肠之思，凝练于一个“问梅”的细节上，仿佛只是一般性的寒暄，很寻常的询问之辞。而从深层看，则是一种精神煎熬后的过望大喜，是一种久处孤独后而急于消渴的情感冲动，他见到故乡来人，生成一种惊喜状与探知欲，这株寒梅也自然成其思乡之情的集中寄托。全诗寓巧于朴，直抒胸臆，写出一种缠绵深婉之情。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '鸟鸣涧',
    author: '唐·王维',
    paragraphs: [
      '人闲桂花落', '夜静春山空',
      '月出惊山鸟', '时鸣春涧中',
    ],
    desc: '《鸟鸣涧》是一首山水诗。此诗描绘春夜空山幽深而美丽的景色，侧重于表现夜间春山的宁静幽美。全诗紧扣“静”字着笔，极似一幅风景写生画。诗人用花落、月出、鸟鸣等活动着的景物，突出表现了月夜春山的幽静，取得了以动衬静的艺术效果，生动地勾勒出一幅“鸟鸣山更幽”的诗情画意图。全诗旨在写静，却以动景处理，这种反衬的手法极见诗人的禅心与禅趣。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '画',
    author: '唐·王维',
    paragraphs: [
      '远看山有色', '近听水无声',
      '春去花还在', '人来鸟不惊',
    ],
    desc: '　《画》是一首五言绝句。此诗表面描写的是自然景物，实际赞叹的是一幅画作。前两句写其山色分明，流水无声；后两句描述其花开四季，鸟不怕人。四句诗构成了一幅完整的山水花鸟图，充满自然情趣。全诗对仗工整，尤其是诗中多组反义词的运用，使其节奏清晰，平仄分明，韵味十足，读来朗朗上口。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '临湖亭',
    author: '唐·王维',
    paragraphs: [
      '轻舸迎上客', '悠悠湖上来',
      '当轩对尊酒', '四面芙蓉开',
    ],
    desc: '《临湖亭》是一首五言绝句，诗人在亭子里等待、迎接贵宾，轻舸在湖上悠然驶来。宾主围坐临湖亭开怀畅饮，窗外就是一片盛开的莲花。全诗将美景、鲜花、醇酒和闲情巧妙地融于一体，在自然中寄深意，与质朴中见情趣，其娟秀飘逸的意境，令人陶醉和神往。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '独坐敬亭山',
    author: '唐·李白',
    paragraphs: [
      '众鸟高飞尽', '孤云独去闲',
      '相看两不厌', '只有敬亭山',
    ],
    desc: '《独坐敬亭山》是一首山水诗。这首诗表面上描述了诗人独游敬亭山的闲情逸趣，而更深层次的意蕴，是其对于生命历程中旷世孤独感的抒发。他抒写自己的孤独和怀才不遇，也更进一步展现了自己的坚定信念，意图在大自然中寻找安慰与寄托。全诗以奇特的想象力和巧妙构思，赋予山水景物以生命，将敬亭山拟人化，十分生动鲜活，充满了深刻的内涵和独特的艺术魅力。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '夜宿山寺',
    author: '唐·李白',
    paragraphs: [
      '危楼高百尺', '手可摘星辰',
      '不敢高声语', '恐惊天上人',
    ],
    desc: '《夜宿山寺》是一首五言绝句。此诗运用了极其夸张的手法，描写了寺中楼宇的高耸，表达了诗人对古代庙宇工程艺术的惊叹以及对神仙生活的向往和追求之情。全诗语言朴素自然，想象瑰丽，夸张巧妙，活灵活现，给人以丰富的联想和身临其境之感。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '怨情',
    author: '唐·李白',
    paragraphs: [
      '美人卷珠帘', '深坐蹙蛾眉',
      '但见泪痕湿', '不知心恨谁',
    ],
    desc: '《怨情》是一首五言绝句。这首诗抒写一位女子的幽怨，而不直截了当地写怨，前三句只作其神态的描绘用赋，末尾才用问句归结“怨情”。这是个动态的过程，首先是“卷珠帘”，然后“深坐”，再“颦蛾眉”，最后“泪痕湿”，行动可见，情态逼人，传神地表现出女子心中深深的愁恨与思念之情。全诗语言平浅简易、含蓄蕴藉、言短意长，写尽缠绵凄凉的情态。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '玉阶怨',
    author: '唐·李白',
    paragraphs: [
      '玉阶生白露', '夜久侵罗袜',
      '却下水晶帘', '玲珑望秋月',
    ],
    desc: '《玉阶怨》是一首五言古诗，此诗写一位女子寂寞和惆怅的心情。前两句写她无言独立玉阶，露水浓重，浸透了罗袜，却还在痴痴等待；后两句写寒气袭人，女子回房放下窗帘，却还在凝望秋月。前两句写久等显示人的痴情；后两句以月亮的玲珑，衬托人的幽怨。全诗无一语正面写怨情，只是抓住宫女生活中的一个细节及一时的心理动态，便概括地反映出宫女生活的孤独清凄，不著怨意而怨意很深，有幽邃深远之美，堪称古诗中的珍品。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '夏日山中',
    author: '唐·李白',
    paragraphs: [
      '懒摇白羽扇', '裸袒青林中',
      '脱巾挂石壁', '露顶洒松风',
    ],
    desc: '《夏日山中》是一首五言绝句。诗中描写夏日中生活的场景，真实、贴切地展现了夏日山中、山中夏日的景象。前二句通过“懒”、“裸”二字突出了诗人在山中夏日乘凉的悠闲情趣。后二句中“脱”、“露”两个动词，自然流露出诗人无拘无束、向往自然的心情。全诗描绘了一幅生动的夏日消闲图画，同时描摹出诗人在山林中旷达潇洒，不为礼法所拘的形象，颇有魏晋风度。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '八阵图',
    author: '唐·杜甫',
    paragraphs: [
      '功盖三分国', '名成八阵图',
      '江流石不转', '遗恨失吞吴',
    ],
    desc: '《八阵图》是一首怀古诗。此诗前二句赞颂诸葛亮的丰功伟绩，尤其称颂他在军事上的才能和建树；后二句对刘备吞吴失师，葬送了诸葛亮联吴抗曹统一中国的宏图大业，表示惋惜。末句照应开头，三句照应二句。在内容上，此诗具有融议论入诗的特点，既是怀古，又是抒怀，议中有情，言外有意，其语言生动形象，抒情色彩浓郁，在绝句中别树一格。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '剑客',
    author: '唐·贾岛',
    paragraphs: [
      '十年磨一剑', '霜刃未曾试',
      '今日把示君', '谁有不平事',
    ],
    desc: '《剑客》是一首五言绝句。此诗前两句描写了剑的不平凡，后两句则希望能有展示才华的机会。诗人以剑客的口吻，着力刻画“剑”和“剑客”的形象，托物言志，抒写自己兴利除弊的政治抱负。全诗感情奔放，气势充沛，将思想性与艺术性结合得自然而巧妙，语言平易，诗思明快。贾岛诗思一贯奇僻，这首诗却率意造语、直吐胸臆，给人别具一格的感受。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '逢雪宿芙蓉山主人',
    author: '唐·刘长卿',
    paragraphs: [
      '日暮苍山远', '天寒白屋贫',
      '柴门闻犬吠', '风雪夜归人',
    ],
    desc: '《逢雪宿芙蓉山主人》是一首五言绝句。这首诗用极其凝炼的诗笔，描画出一幅以旅客暮夜投宿、山家风雪人归为元素的寒山夜宿图。首句写诗人薄暮在山路上行进时所感，次句写到达投宿人家时所见，后两句写入夜后在投宿人家所闻。每句诗都构成一个独立的画面，而又彼此连属，诗中有画，画外见情。全诗格调清雅淡静，语言浅近，写景如画，叙事简朴，具有悠远的意境与无穷的韵味。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '梅花',
    author: '宋·王安石',
    paragraphs: [
      '墙角数枝梅', '凌寒独自开',
      '遥知不是雪', '为有暗香来',
    ],
    desc: '《梅花》是一首五言绝句。此诗前两句写墙角梅花不惧严寒，傲然独放的姿态；后两句则叙写了梅花的幽香。诗人在此赞美了梅花的坚毅与高贵，同时也以梅花自比，表达自己即使在艰难环境中仍能坚持操守、主张正义、心性坚定、品格高洁。全诗语言朴素，文笔平实内敛，却自有深致，耐人寻味。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '夏日绝句',
    author: '宋·李清照',
    paragraphs: [
      '生当作人杰', '死亦为鬼雄',
      '至今思项羽', '不肯过江东',
    ],
    desc: '《夏日绝句》是一首借古讽今、抒发悲愤之情的怀古诗。诗的前两句语出惊人，直抒胸臆，提出人“生当作人杰”，为国建功立业、报效朝廷，“死”也应该做“鬼雄”，方才不愧为顶天立地的好儿郎，深切的爱国之情从中喷涌而出，震撼人心。最后两句，诗人通过歌颂项羽的悲壮之举来讽刺丈夫赵明诚和南宋当局者不思进取、苟且偷生的无耻行径。全诗只有短短二十个字，却连用三个典故，可谓字字珠玑，字里行间透出一股正气。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '渡汉江',
    author: '唐·宋之问',
    paragraphs: [
      '岭外音书断', '经冬复历春',
      '近乡情更怯', '不敢问来人',
    ],
    desc: '《渡汉江》是一首五言绝句。这是诗人久离家乡而返归途中所写的抒情诗，意在写思乡情切，表现出其对家乡和对亲人的挚爱之情和游子远归家乡时激动、不安、畏怯的复杂心理。前两句主要追叙久居岭外的情况，后两句抒写诗人接近家乡时矛盾的心情。全诗语极浅近，意颇深邃，其描摹心理熨贴入微；语言毫不矫揉造作，自然至美。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '秋风引',
    author: '唐·刘禹锡',
    paragraphs: [
      '何处秋风至', '萧萧送雁群',
      '朝来入庭树', '孤客最先闻',
    ],
    desc: '《秋风引》是一首五言绝句。全诗四句，前两句写秋风始至，鸿雁南来；后两句写风吹庭树，孤客先闻。此诗表面写秋风，实际却是在感叹自己的际遇，抒发了诗人的羁旅之情和思归之心。其妙处在于不从正面着笔，始终只就秋风做文章，行文曲折见意，含蓄不尽。',
    type: PoetryType.FiveCharacterOctave,
  }
];

export const getPoetryList = () => {
  return poetryList.map(poetry => {
    return {
      ...poetry,
      characters: poetry.paragraphs.join('').split('').sort(() => Math.random() - 0.5),
    }
  });
}
