import { Poetry, PoetryType } from "./poetry-match.types";

const poetryList: Poetry[] = [
  {
    title: '静夜思',
    author: '唐·李白',
    paragraphs: [
      '床前明月光', '疑是地上霜',
      '举头望明月', '低头思故乡',
    ],
    desc: '《静夜思》是一首五言诗，此诗描写了旅居在外的诗人于秋日夜晚在屋内抬头望月而思念家乡的感受。前两句写诗人在作客他乡的特定环境中一刹那间所产生的错觉；后两句通过动作神态的刻画，深化主人公的思乡之情。全诗没有奇特新颖的想象，没有精工华美的辞藻，只是用叙述的语气，采取比喻、衬托等手法，表达客居思乡之情，语言清新朴素而韵味含蓄无穷，历来广为传诵。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '春晓',
    author: '唐·孟浩然',
    paragraphs: [
      '春眠不觉晓', '处处闻啼鸟',
      '夜来风雨声', '花落知多少',
    ],
    desc: '《春晓》是一首五言绝句。此诗抓住诗人早晨刚醒时的一瞬间展开联想，描绘了一幅春晨绚丽的图景，抒发了诗人热爱春天、珍惜春光的美好心情。首句破题，写春睡的香甜，也流露着对朝阳明媚的喜爱；次句即景，写悦耳的春声，也交代了醒来的原因；第三句转写回忆；末句又回到眼前，由喜春翻为惜春。全诗语言平易浅近，自然天成，言浅意浓，景真情真，深得自然意趣。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '相思',
    author: '唐·王维',
    paragraphs: [
      '红豆生南国', '春来发几枝',
      '愿君多采撷', '此物最相思',
    ],
    desc: '《相思》是一首五言绝句，此诗借咏物而寄相思，全篇不离红豆，用其相思子之名以关合相思之情。首句写红豆产地；次句以“发几枝”一问，此语极朴实，而又极富形象性，设问自然，暗寓情怀；第三句寄意友人“多采撷”，言在此而意在彼；末句点明其相思属性，用一“最”字将情感推达极致，使“多采撷”的理由自见，且自身所寄之意亦深含其中。全诗风格明快，却又委婉含蓄，语浅而情深，相传当时即为人谱曲传唱，流行江南。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '寻隐者不遇',
    author: '唐·贾岛',
    paragraphs: [
      '松下问童子', '言师采药去',
      '只在此山中', '云深不知处',
    ],
    desc: '《寻隐者不遇》是一首五言古诗。此诗首句写寻者问童子，后三句都是童子的答话，诗人采用寓问于答的手法，把寻访不遇的焦急心情描绘得淋漓尽致。诗中以白云比隐者的高洁，以苍松喻隐者的风骨，写寻访不遇，愈衬出寻者对隐者的钦慕高仰之情。全诗遣词通俗清丽，白描无华，情真意切，言简义丰。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '江雪',
    author: '唐·柳宗元',
    paragraphs: [
      '千山鸟飞绝', '万径人踪灭',
      '孤舟蓑笠翁', '独钓寒江雪',
    ],
    desc: '《江雪》是一首五言绝句。诗中运用典型概括的手法，选择千山万径，人鸟绝迹这种最能表现山野严寒的典型景物，描绘大雪纷飞，天寒地冻的图景；接着勾画独钓寒江的渔翁形象，借以表达诗人在遭受打击之后坚韧不屈、坚守信念却又深感孤寂的情绪。全诗构思独特，语言简洁凝练，意蕴丰富。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '登鹳雀楼',
    author: '唐·王之涣',
    paragraphs: [
      '白日依山尽', '黄河入海流',
      '欲穷千里目', '更上一层楼',
    ],
    desc: '《登鹳雀楼》是一首五言绝句。此诗前两句写的是自然景色，开笔就有缩万里于咫尺之势；后两句写意，把哲理与景物、情势融合得天衣无缝。诗人在受到大自然震撼之后，悟出的是朴素而深刻的哲理：登高放眼，能够催人抛弃固步自封的浅见陋识，不断拓出愈益美好的崭新境界。清代诗评家认为：“王诗短短二十字，前十字大意已尽，后十字有尺幅千里之势。”此诗篇幅虽短，却以千钧巨椽，绘下北国河山的磅礴气势和壮丽景象，气势磅礴、意境深远。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '宿建德江',
    author: '唐·孟浩然',
    paragraphs: [
      '移舟泊烟渚', '日暮客愁新',
      '野旷天低树', '江清月近人',
    ],
    desc: '《宿建德江》是一首山水诗，刻画了秋江暮色，是唐人五绝中的写景名篇。诗人把小船停靠在烟雾迷蒙的江边思忆往昔，以舟泊暮宿作为自己抒发感情的归宿，流露出羁旅之思。首联点题，为下文写景抒情作铺垫；颔联中“日暮”是“客愁新”的原因；颈、尾两联中，因为“野旷”所以天低于树，因为“江清”所以月能近人，将天和树、人和月的关系，写得恰切逼真。此诗前两句为触景生情，后两句为借景抒情，描写了清新的秋夜，细腻地表现了景物特点，其格调淡而有味、含而不露，自然流出、风韵天成，颇有特色。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '秋夜寄邱员外',
    author: '唐·韦应物',
    paragraphs: [
      '怀君属秋夜', '散步咏凉天',
      '空山松子落', '幽人应未眠',
    ],
    desc: '《秋夜寄丘二十二员外》是一首五言绝句，此诗表达诗人在秋夜对隐居朋友的思念之情。诗的前两句写诗人自己，即怀人之人；后两句写正在临平山学道的丘丹，即所怀之人。全诗语淡而情浓、言短而意深，诗人从容落笔，浅浅着墨，格调古朴雅致，安闲恬淡，具有悠永的韵味，玩绎不尽。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '登乐游原',
    author: '唐·李商隐',
    paragraphs: [
      '向晚意不适', '驱车登古原',
      '夕阳无限好', '只是近黄昏',
    ],
    desc: '这首诗赞美黄昏前的绮丽风光，抒发了诗人即景而生的感慨。前两句点出其登原游览的原因：由于黄昏日暮心情不适，便驱车登上古原；后两句极力赞叹晚景之美：在夕阳余晖照耀下，涂抹上一层金色的世界，此两句并非简单地盛赞无限美好的夕阳，其意蕴丰富，具有极高的美学价值和思想价值。全诗语言明白如话，毫无雕饰，节奏明快，感喟深沉，富于哲理。',
    type: PoetryType.FiveCharacterOctave,
  }, {
    title: '送别',
    author: '唐·王维',
    paragraphs: [
      '山中相送罢', '日暮掩柴扉',
      '春草明年绿', '王孙归不归',
    ],
    desc: '《送别》是一首五言绝句。此诗描写送别友人，表达了对友人的依依不舍之情，其题材普遍，构思却独具匠心，极有特色。它最显著的特点在于并非就“送别”二字做文章，而着墨于送别后的行动与思绪，并表达了诗人期盼来年春草再绿时能与友人团聚的情怀。全诗语言朴素自然，感情深厚真挚，意中有意，味外有味，匠心独运，耐人咀嚼。',
    type: PoetryType.FiveCharacterOctave,
  }
];

export const getPoetryList = () => {
  return poetryList.map(poetry => {
    return {
      ...poetry,
      characters: poetry.paragraphs.join('').split('').sort(() => Math.random() - 0.5),
    }
  });
}
